Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: དེས་ན་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་སྤྱན་དེས་ཇི་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་མངོན་པར་འདུ་མཛད་དེ། དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ། མངོན་པར་འདུ་མཛད་པས་རྒྱལ་པོ་དྲི་མེད་དབང་བསྐུར་གྱིས་མིའི་འཁོར་དེ་དང་འདོད་པ་ན་སྤྱོད་པའི་ལྷའི་འཁོར་དེ་དང་། ཚངས་རིས་ཀྱི་ལྷའི་འཁོར་དེ་དག་མཐོང་ངོ་། །
en: However, by the miraculous power of the thus-gone Vimalanetra, the entire retinue of humans, gods of the desire realm, and gods of the Brahmā Realm became visible to King Immaculate Consecration.

source: མཐོང་ནས་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Witnessing all that, he thought,

source: དེ་བཞིན་གཤེགས་པ་དྲི་མེད་སྤྱན་དེ་ལ་ཕྱིར་རྒོལ་བར་སུས་ཀྱང་མི་ནུས་ཏེ། འདི་ནི་གནས་མ་ཡིན་ནོ། །
en: ‘No one can repudiate the thus-gone Vimalanetra. It is impossible !

source: གང་འདོད་པ་ན་སྤྱོད་པའི་ལྷ་འདི་དག་ཐམས་ཅད་ཐལ་མོ་སྦྱར་བ་དང་། ཚངས་རིས་ཀྱི་ལྷ་འདི་དག་བར་སྣང་ལ་ཐལ་མོ་སྦྱར་ཏེ་འདུག་པས་ཕྱིར་བརྒལ་བར་གང་ལྷ་དག་གིས་ཀྱང་མི་ནུས་ན་མིར་གྱུར་པས་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་སྙམ་ནས་
en: Not even all these gods of the desire realm that are here with their palms together, or the gods of the Brahmā Realm that are here in midair with their palms together could repudiate him, so forget about someone human.’

source: དེ་སྟན་ལས་ལངས་ཏེཔུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་སྤྱན་དེ་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་སྤྱན་དེ་ལ་ཚིགས་སུ་བཅད་དེ་མངོན་པར་བསྟོད་པ།། །།
en: He then stood up from his seat, knelt on his right knee, and, bowing toward the Thus-Gone One with his palms together, praised the blessed thus-gone Vimalanetra with these verses:

source: མཁྱེན་རབ་ཆེན་པོ་ཆོས་ཀུན་ཕ་རོལ་གཤེགས་ལ་ཕྱག་འཚལ་ལོ། །
en: “ ‘With great wisdom you have gone beyond all phenomena—homage to you!

source: ལྷར་བཅས་འཇིག་རྟེན་གང་དག་ཁྱོད་ལ་ཐལ་མོ་སྦྱར་ནས་མཆིས། །
en: The entire world, including the gods, is here before you with palms joined.

source: ལྷ་དང་མི་དང་དྲི་ཟ་མིའམ་ཅི་དང་ལྟོ་འཕྱེ་ཆེ། །སངས་རྒྱས་ལ་ནི་ཐམས་ཅད་ཐལ་མོ་སྦྱར་ནས་ལྟ་ཞིང་མཆིས། །
en: Gods, humans, gandharvas, kiṃnaras, and mahoragas— All are here, gazing upon the Buddha with joined palms.

source: འདི་ཀུན་བཅོམ་ལྡན་འདས་ཀྱི་མཁྱེན་རབ་ཀུན་ཏུ་གཟིགས་ནས་མཆིས། །
en: “ ‘They are here because the Blessed One possesses all-seeing wisdom.

source: དེས་ན་ལྷར་བཅས་འཇིག་རྟེན་ཐལ་མོ་སྦྱར་ནས་ཕྱག་འཚལ་བགྱིད། །
en: That is why the whole world, including the gods, now join their palms in homage.

source: མཁྱེན་རབ་ཆེན་པོ་ཁྱོད་ཀྱི་མཁྱེན་རབ་ཐོབ་ཕྱིར་ཕྱག་འཚལ་ཏེ། །
en: Lord of great wisdom, they pay homage that they may achieve your wisdom.

source: འདི་ཀུན་བཅོམ་ལྡན་འདས་ཀྱི་མཁྱེན་རབ་ཀུན་དུ་བཟུང་ནས་མཆིས། །
en: They have gathered here, embraced by the Blessed One’s wisdom.

source: ཁྱོད་ཀྱི་གཟུགས་དང་འདྲ་བ་མ་མཆིས་མཁྱེན་རབ་འདྲ་མ་མཆིས། །
en: “ ‘No one has a body or wisdom like yours.

source: འདི་ཀུན་རྐང་གཉིས་མཆོག་ལ་ཡིད་ཀྱིས་ཤེས་པར་བགྱིས་ནས་མཆིས། །
en: All are here to know the supreme human.

source: ཇི་ལྟར་ཐོས་བཞིན་དེ་ལྟར་མཐོང་སྟེ་དེ་བས་ལྷག་པར་བཟང་། །
en: Now we see what we had heard about, yet what we see is even more magnificent.

source: བདག་གིས་བདེ་གཤེགས་མཐོང་བའི་བདག་ནི་མི་ཉིད་ལེགས་པར་རྙེད། །
en: Beholding the Blissful One, our human lives have now borne fruit.

source: ལྷ་ཀླུ་གནོད་སྦྱིན་ལྷ་མ་ཡིན་དང་དེ་བཞིན་སྲིན་པོ་དག །འཇིག་རྟེན་གསུམ་ན་ཁྱོད་དང་འདྲ་བ་མ་མཆིས་སོ། །
en: “ ‘Among gods, nāgas, yakṣas, demigods, and rākṣasas There is no one like you—no one like you within three worlds.

source: འདྲེན་པ་གང་ལ་བདག་གིས་སྔོན་གྱི་བརྒལ་བའི་སེམས་བྱུང་བ། །འཇིག་རྟེན་འདྲེན་པ་མཐོང་བ་ཙམ་གྱིས་དེ་ཉིད་མ་མཆིས་སོ། །
en: Whatever incorrect thoughts we may have had about the Guide, They now all disappear, simply by seeing the Guide of the World.

source: བརྩོན་ཆེན་མཁྱེན་རབ་ཐུགས་བརྩེར་ལྡན་པ་ཁྱོད་ལ་ཞུ་བགྱི་བ། །དགེ་བའི་ལས་གང་བགྱིས་པས་སྐྱོན་རྣམས་ཀུན་གྱིས་གོས་མི་འགྱུར། །
en: “ ‘Great master of diligence, wisdom, and love, please now explain Which acts of goodness will deliver from all flaws and stains.’

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་སྤྱན་གྱིས་རྒྱལ་པོ་བདུད་རྩི་དབང་བསྐུར་དེའི་ཤེས་རབ་འདི་ལྟ་བུ་འབྱུང་པོ་ཐམས་ཅད་ལ་ཕན་པ་དང་བདེ་བ་དེ་གསན་ནས།
en: The thus-gone Vimalanetra listened to King Immaculate Consecration’s words of insight for the benefit and happiness of all beings.

source: གསུང་མ་འཁྲུལ་བ་དང་སྤོབས་པ་གྲོལ་བས་རྒྱལ་པོ་བདུད་རྩིའི་དབང་བསྐུར་དེ་ལ་སླར་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: With his flawless voice and liberated eloquence he then spoke the following verses in reply:

source: འཇིག་རྟེན་ཀུན་ལ་ཕན་བྱེད་ཞུ་བ་ཞུས་པ་ལེགས་སོ་ལེགས། །
en: “ ‘Excellent that you ask this to benefit the whole world, excellent!

source: ཁྱེད་ཀྱི་དོན་དེ་བཤད་ཀྱི་ཇི་ལྟ་བ་བཞིན་ང་ལ་ཉོན། །
en: Listen, for I shall explain this to you accurately.

source: འབར་བ་ལྟ་བུར་ཡེ་ཤེས་གང་གིས་ཉོན་མོངས་སྲེག་པར་བྱེད། །
en: Like a blazing fire, wisdom burns away the afflictions.

source: དེ་ནི་ཤེས་ནས་ཡང་དག་བསྡུས་ཏེ་དེ་འདྲར་སྒྲུབ་བྱེད་ན། །
en: When understood, absorbed, and practiced in this way,

source: ཉོན་མོངས་དག་ལས་རྣམ་གྲོལ་ཤེས་པ་དེ་ལ་མི་ཆགས་ཏེ། །
en: “ ‘There is no attachment to the knowledge that liberates from afflictions.

source: ཇི་ལྟར་ཕ་རོལ་ཕྱིན་པ་གཟིངས་ལ་ལྟོས་མེད་བོར་ནས་འགྲོ། །
en: Just as a boat is left behind on the far shore and one proceeds without any thought of it,

source: དེ་བཞིན་རྒྱལ་བའི་མཁྱེན་པས་སྡུག་བསྔལ་རྒྱུ་ནི་སྲེག་བྱེད་ལ། །
en: So the wisdom of the victorious ones burns away the causes of suffering.

source: ཤེས་པ་དེ་ལ་གནས་པར་མི་བྱེད་འདི་ནི་དགེ་བའི་ལམ། །
en: Yet it does not dwell in that knowledge—such is the path of virtue.

source: བྱང་ཆུབ་སེམས་དཔའ་འཇིགས་མེད་མཁས་པ་དེ་ནི་འདིར་སློབ་ནརྟག་ཏུ་མཉམ་པར་གཞག་ཅིང་རྣམ་གཡེང་འདི་དག་མེད་པར་འགྱུར། །
en: “ ‘When dexterous and fearless bodhisattvas train in this They are constantly in equipoise and their distractions disappear.

source: བྱང་ཆུབ་གཞོལ་བའི་སེམས་ཀྱིས་འཆག་པ་དང་ནི་གནས་པ་དང་། །
en: Whether moving or staying, their minds are absorbed in awakening.

source: མཁས་པ་ཤེས་རབ་བཅས་པ་འདུག་དང་མལ་དུ་ཉལ་བར་བྱེད། །
en: At rest or asleep, the wise are endowed with insight.

source: ཆོས་ཀུན་ངོ་བོ་ཉིད་ཀྱིས་ངོ་བོ་མེད་པར་རབ་ཏུ་ཤེས། །མཁས་པ་ཆོས་རྣམས་ཐམས་ཅད་ལ་ནི་གནས་པར་མི་བྱེད་དོ། །
en: “ ‘Knowing all phenomena to be, in essence, devoid of essence, The wise do not dwell on any phenomena.’

source: འཇིག་རྟེན་མགོན་པོ་སྐྱོབ་པ་དེ་ཡི་གསུང་དེ་ཐོས་ནས་སུ། །ཡིད་ལ་བརྣག་པ་དགའ་ཞིང་སྟོན་པ་ལ་ནི་མངོན་པར་བསྟོད། །
en: When he heard the voice of the world’s protector and savior, King Immaculate Consecration took it to heart and praised the teacher:

source: འཇིག་རྟེན་སྤྱོད་བཅོམ་འཇིག་རྟེན་གསལ་མཛད་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: “ ‘Conquering worldly conduct you illumine the world—homage to you!

source: འདྲེན་པ་རང་གི་གྲོལ་བས་སེམས་ཅན་དག་གི་སྡུག་བསྔལ་བཀྲོལ། །
en: The guides liberate beings’ suffering through their own liberation.

source: དེད་དཔོན་བླ་ན་མེད་པ་བརྩོན་འགྲུས་ཆེན་པོ་མྱུར་མཛད་པ། །
en: The unsurpassed captains act swiftly with great diligence.

source: འདྲེན་པ་རང་གི་རྒལ་བས་སེམས་ཅན་མང་པོ་དེ་དག་བསྒྲལ། །
en: The guides deliver multitudes of beings through their own crossing.

source: ཁྱོད་ཀྱིས་མ་རིག་པ་ཡི་སྦུབས་བཅོམ་ཁྱོད་ཀྱིས་སྣང་བ་བསྟན། །
en: “ ‘Crushing the sphere of ignorance, you let the light shine.

source: ཁྱོད་ཀྱིས་འོད་དཔག་མེད་པས་སངས་རྒྱས་ཞིང་ནི་རབ་ཏུ་སྣང་། །
en: With boundless light you illumine the buddha realms.

source: ཁྱོད་ཀྱི་འོད་ཀྱིས་ཀུན་མཁྱེན་སངས་རྒྱས་ཞིང་ནི་དཔག་ཏུ་མེད། །གྲངས་མེད་བྱེ་བ་དག་ཏུ་སྣང་བས་རྟག་ཏུ་ཁྱབ་པར་མཛད། །
en: Constantly you let your light shine throughout Millions of fields of omniscient buddhas, beyond measure and count.

source: སྒྲ་གཅན་ཟླ་བ་བཏང་ལྟར་ནམ་མཁའི་དཀྱིལ་ན་དྲི་མ་མེད། །ཟླ་བ་རྣམ་པར་སྣང་ལྟར་དེ་བཞིན་སངས་རྒྱས་རྣམ་པར་སྣང་། །
en: “ ‘When released by Rāhu, the moon appears stainless in the sky, And like the radiant moon, the buddhas are resplendent.

source: ལྷ་མ་ཡིན་གྱི་ཞགས་བཅད་ནམ་མཁའི་དཀྱིལ་ན་དྲི་མ་མེད། །ཉི་མའི་འོད་ཟེར་བརྒྱ་དག་རྣམ་ཤར་བར་སྣང་གསལ་བྱེད་ལྟར། །
en: Cutting the shackles of the demigods, the sun appears stainless in space And shines at dawn with hundreds of brilliant rays.

source: བདུད་ཀྱི་ཞགས་པ་བཅད་ནས་སངས་རྒྱས་ཉི་མ་ཡང་དག་འཕགས། །
en: “ ‘Likewise, the noble sun of the buddhas breaks the chains of the māras;

source: བདུད་ཕྱོགས་ངེས་པར་བཅོམ་ནས་སངས་རྒྱས་ལམ་ལ་རྣམ་སྣང་མཛད། །
en: Vanquishing the māra hordes, the buddhas illumine the path.

source: སྲིན་བུ་མེ་ཁྱེར་འོད་པས་ཉི་འོད་ཡང་དག་འཕགས་པ་ལྟར། །རྒྱལ་བའི་ཉི་མ་ཡང་དག་འཕགས་པས་མུ་སྟེགས་སྣང་བར་མཛད། །
en: Just like the light of a firefly is outshone by the sun, The sun of the victorious ones will outshine the extremists.

source: འདི་ལྟར་འཇིག་རྟེན་མགོན་པོ་འོད་མཛད་པ་ལ་སྐྱབས་སུ་མཆི། །
en: “ ‘Thus the shining protector of the world remains the refuge,

source: མུན་པར་བྱེད་པ་བཅོམ་ནས་ཀུན་ཏུ་སྣང་བ་རྣམ་པར་བསྟན། །
en: Vanquishing the sources of darkness and revealing the brightest light.

source: ཉི་མ་ཀུན་མིག་སྣང་ལྟར་སངས་རྒྱས་སྤྱན་ནི་རྣམ་པར་སྣང་། །
en: Like the sun that shines for all eyes, the buddha eye shines;

source: སྟོན་ཀའི་སྤྲིན་ལས་ཉི་མ་ཤར་ལྟར་རྣམ་པར་སྣང་བར་མཛད། །
en: Like the sun that emerges from the autumn clouds, it shines its light.’

source: དེ་ནས་རྒྱལ་པོ་བདུད་རྩིས་དབང་བསྐུར་གྱི་ཞུ་བ་ལུང་བསྟན་པ་འདིས་མངོན་པར་དགའ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་སྤྱན་དེ་ལ་ཚིགས་སུ་བཅད་དེ་
en: “Thus, thoroughly delighted by the thus-gone Vimalanetra’s response to his request, King Immaculate Consecration uttered these verses of praise.

source: མངོན་པར་བསྟོད་པའི་དགེ་བའི་རྩ་བ་དེས་བསྐལ་པ་གྲངས་མེད་པ་དགུ་བཅུ་རྩ་དྲུག་ཏུ་ལོག་པར་མ་སོང་ཞིང་ནམས་ཀྱང་རིགས་ངན་དག་ཏུ་མ་སྐྱེས།
en: Due to the ensuing roots of virtue he avoided unfortunate rebirths for ninety-six innumerable eons, and he was never born into the lower classes.

source: ནམས་ཀྱང་སོ་སྔོར་མ་གྱུར་མིག་སེར་པོར་མ་ཡིན་འཇིགས་པའི་མིག་ཏུ་མ་ཡིན། རྣམ་པར་འཁྲུལ་པའི་མིག་ཏུ་མ་ཡིན་ཏེ།
en: His teeth never rotted and his eyes were never yellow, fearful, or deluded.

source: རྟག་པར་རྒྱུན་དུ་བདག་ཉིད་འོད་ཅན་དུ་གྱུར། འདྲེན་པ་དང་ཤེས་པ་དང་ཆོ་འཕྲུལ་ཅན་དུ་གྱུར།
en: He was always radiant and endowed with mindfulness, knowledge, and miraculous powers .

source: སངས་རྒྱས་ཀྱིས་གནང་། སངས་རྒྱས་ཀྱི་ཞིང་གང་དུ་སྐྱེས་པ་དེར་སངས་རྒྱས་འབྱུང་བ་ཤིན་ཏུ་ཤེས།
en: Cared for by the buddhas, he would be born into buddha realms, and there always recognize the buddha present.

source: དེར་སྲོག་ཆགས་ཤིན་ཏུ་འཁོར་བ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དཔག་ཏུ་མེད་པ་དག་ཐེག་པ་གསུམ་སྟེ། ཉན་ཐོས་ཀྱི་ཐེག་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པའམ། བླ་ན་མེད་པའི་སངས་རྒྱས་ཀྱི་ཐེག་པས་འདུལ་བར་བྱེད་དོ། །
en: In this way he trained innumerable trillions of beings in cyclic existence by means of the three vehicles of hearers, solitary buddhas, and unsurpassed buddhas.

source: མཽད་གལ་གྱི་བུ་ཁྱོད་དེའི་ཚེ་དེའི་དུས་ན། རྒྱལ་པ་བདུད་རྩིས་དབང་བསྐུར་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་ཐེ་ཙོམ་མམ་ཡིད་གཉིས་ཟ་ན་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Maudgalyāyana, in case you may have any doubts or hesitations so as to think that at that time King Immaculate Consecration was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་བདུད་རྩིས་དབང་བསྐུར་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was King Immaculate Consecration.

source: ང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་སྨོན་ལམ་འདི་ལྟ་བུ་དག་བཏབ་སྟེ། བདག་སངས་རྒྱས་ཀྱི་ཞིང་གང་དུ་སྐྱེས་པ་དེར་སངས་རྒྱས་བྱུང་བར་སེམས་ཅན་དག་ཤིན་ཏུ་ཤེས་པར་གྱུར་ཅིག །
en: As I engaged in the practice of a bodhisattva, I prayed that the beings of the buddha realms into which I am born will always become aware of the presence of the Buddha.

source: སྨོན་ལམ་དེ་ལྟ་བུས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན།
en: Keeping that wish, I engaged in the practice of a bodhisattva.

source: འདི་ལྟར་དེ་གནོད་སེམས་མེད་པའི་སེམས་སུ་གྱུར་པའི་ཕྱིར་ཤེས་པ་དེ་ལ་མངོན་པར་ཞེན་པས་སེམས་ཅན་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་བཏུལ་ཏོ། །
en: Since that mindset was free of any ill will, I was able to train, by remaining attached to that, innumerably many tens of thousands of beings.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པར་བྱ་ཞིང་ཡོངས་སུ་སྦྱང་བར་བྱའོ། །
en: Maudgalyāyana, it is in that way that bodhisattva great beings should complete and perfect their aspirations.”

source: མཽད་གལ་གྱི་བུ་ངས་རྣམ་པར་གནས་པ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སེམས་ཅན་རྣམས་ལ་རྣམ་པར་གནས་པ་ཤེས་པ་ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ་སྙམ་ནསདགེ་བའི་རྩ་བ་རྒྱ་ཆེ་བ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created unfathomably numerous roots of virtue in order to understand abiding. I did this by wondering, ‘How can I fully awaken to unsurpassed and perfect buddhahood and then teach beings about the knowledge of abiding?’

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དེ་བཞིན་གཤེགས་པ་ནྱ་གྲོ་དྷའི་རྒྱལ་པོ་ཞེས་བྱ་བ་ནས།
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past, there appeared in the world a thus-gone one named King of Banyan Trees;

source: དེ་བཞིན་གཤེགས་པ་ནྱ་གྲོ་དྷའི་རྒྱལ་པོ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་བརྗོད་དུ་མེད་པ་དགུ་བཅུ་རྩ་དྲུག་ཏུ་གྱུར་ཏོ། །
en: The buddha realm of the thus-gone King of Banyan Trees consisted of ninety-six ineffable worlds.

source: དེའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་གྲོང་ཁྱེར་རྒྱ་ཆེ་བ་དེར་ཐམས་ཅད་ནས་ཐམས་ཅད་དུ་སེམས་ཅན་དམྱལ་བ་མ་བྱུང་། དུད་འགྲོའི་སྐྱེ་གནས་མེད། གཤིན་རྗེའི་འཇིག་རྟེན་མེད།
en: Throughout the vast cities of that buddha realm there were no realms of hell, no animals, nor any realms of the Lord of Death.

source: སེམས་ཅན་གྱི་མདོག་ཐ་དད་པ་ཉིད་གང་ཡང་མེད་དེ། སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱི་མདོག་གཅིག་ཏུ་གྱུར་ཏེ། འདི་ལྟ་སྟེ། གསེར་གྱི་མདོག་གོ། །
en: Sentient beings there were not of different complexion, but all were alike, sharing the same golden color.

source: སེམས་ཅན་གྱི་དབྱིབས་ཐ་དད་པ་ཉིད་གང་ཡང་མེད་དེ། སེམས་ཅན་དེ་དག་ཐམས་ཅད་ནྱ་གྲོ་དྷའི་ཚད་དུ་གྱུར་ཏོ། །
en: The shapes of the beings there were not different either, as all grew to the size of a banyan tree.

source: སེམས་ཅན་གྱི་ལོངས་སྤྱོད་ཐ་དད་པ་ཉིད་གང་ཡང་མེད་དེ་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ལོངས་སྤྱོད་གཅིག་ཏུ་གྱུར་ཏོ། །
en: Neither did their possessions differ, because all property was shared,

source: སེམས་ཅན་གྱི་ཚེའི་ཚད་ཐ་དད་པ་ཉིད་གང་ཡང་མེད་དེ་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཚེའི་ཚད་ངེས་པར་གྱུར་ཏེ། འདི་ལྟ་སྟེ། སེམས་ཅན་རྣམས་ཚེའི་ཚད་ལོ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་བརྒྱད་ཅུར་གྱུར་ཏོ། །
en: and the beings of that realm did not have different lifespans. Everyone’s life was equally long, lasting for eighty trillion years.

source: སེམས་ཅན་གང་ཡང་དུས་བྱེད་པ་ལས་ལྷག་པར་འདའ་བ་མེད་པར་གྱུར། སེམས་ཅན་གང་ཡང་ཡ་ང་བ་མ་སྤངས་པས་དུས་བྱེད་པར་མ་གྱུར་ཏེ།
en: No one died from anything but natural causes and no one would die with fear.

source: སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཁྱད་པར་དུ་འགྲོ་བའི་དུས་བྱེད་པར་གྱུར་ཏོ། །
en: Everyone would pass away in special circumstances.”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གང་གི་ཚེ་སེམས་ཅན་དེ་དག་ཐམས་ཅད་བྱེ་བྲག་མ་མཆིས་པར་གྱུར་པ་ལགས་ན། སེམས་ཅན་དེ་དག་དེ་ནས་གུམ་ནས་ཇི་ལྟར་ཁྱད་པར་དུ་མཆི་བར་འགྱུར་ལགས།
en: “Blessed One,” inquired venerable Maudgalyāyana, “if beings there were not different from each other, how could their deaths be special?”

source: དེ་སྐད་ཅེས་གསོལ་བ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One replied,

source: ཆོས་འདི་དག་ལ་འགྲོ་བ་ཞེས་བྱ་བ་མི་སྣང་སྟེ།
en: Generally, there is no apparent existence with respect to phenomena.

source: ཆོས་འདི་དག་ལ་ཉན་ཐོས་རྣམས་ཀྱི་འགྲོ་བ་སྣང་བ་མ་ཡིན། རང་སངས་རྒྱས་རྣམས་ཀྱི་འགྲོ་བ་སྣང་བ་མ་ཡིན།
en: Therefore, with respect to phenomena there is also no apparent existence for hearers or solitary buddhas.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དང་པོ་བསྐྱེད་པ་རྣམས་ཀྱི་གང་རེ་ཤིག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དང་པོ་བསྐྱེད་པ་དེ་དག་ཐམས་ཅད་ཀྱི་འགྲོ་བ་ཡང་འདི་མ་ཡིན་ན། ཉན་ཐོས་རྣམས་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: Even the existence of bodhisattvas who have aroused the mind of awakening for the first time and thus brought forth the initial mind of awakening is also not apparent, so why even mention the hearers?

source: མཽད་གལ་གྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་གང་རྒྱལ་ཚབ་ཀྱིས་ལ་གནས་པ་དེའི་ས་ཡང་མ་ཡིན་ཏེ།
en: Maudgalyāyana, this does not even pertain to the level of those bodhisattvas who abide on the level of a regent.

source: མཽད་གལ་གྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་གི་དགེ་བའི་རྩ་བ་བསྐྱེད་པའི་སྟོབས་ཀྱང་སྣང་ངོ་། །
en: Nevertheless, Maudgalyāyana, they appear due to the power of such bodhisattvas’ roots of virtue.

source: མཽད་གལ་གྱི་བུ་འཇིག་རྟེན་གྱི་ཁམས་དེར་དགེ་བའི་རྩ་བའི་ཆོས་གང་ཡང་རུང་བས་འགྲོ་བ་མ་ཡིན་ཏེ
en: Maudgalyāyana, in this realm, however, beings did not progress by means of any roots of virtue.

source: འོན་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གི་བློ་ཉིན་མཚན་དུ་འཕེལ་ཞིང་ཡོངས་སུ་མི་ཉམས་ཏེ།
en: Still, the minds of those bodhisattvas would constantly develop, without ever waning, throughout day and night.

source: དེས་ན་ཁྱད་པར་དུ་འགྲོ་བ་ཞེས་བྱའོ། །
en: It is in this sense that they were special.

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་ནྱ་གྲོ་དྷའི་རྒྱལ་པོ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡིད་གཉིས་ལས་ཡང་དག་པར་འདས་པ་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ། །དེ་རྒྱལ་སྲིད་བྱེད་དོ། །
en: “At that time in the realm of the thus-gone King of Banyan Trees there lived a bodhisattva named Beyond Doubt who ruled a kingdom.

source: དེ་ནས་རྒྱལ་པོ་ཡིད་གཉིས་ལས་ཡང་དག་པར་འདས་པའི་འཁོར་གྱི་བུད་མེད་འབུམ་ཕྲག་བརྒྱད་ཅུ་ཡོད་དོ། །བློན་པོ་ཡང་སྟོང་ཐམ་པ་ཡོད་དོ། །
en: In the retinue of King Beyond Doubt there were eight million women, and he had one thousand ministers.

source: དེ་ནས་རྒྱལ་པོ་ཡིད་གཉིས་ལས་ཡང་དག་པར་འདས་པ་བུད་མེད་ཁྲི་ཕྲག་བརྒྱད་ཅུ་པོ་དེ་དག་དང་ལྷན་ཅིག་ཏུ་ཧ་ཅང་ཡང་སྲེད་པ་མེད་པའི་གྲོང་ཁྱེར་གྱི་སྐྱེད་མོས་ཚལ་གྱི་སོས་ཀའི་དུས་ཀྱི་ཤིང་གི་མེ་ཏོག་རྒྱས་པ་དབེན་ཞིང་དགའ་བ་བསིལ་བའི་ཚལ་དུ་སོང་ནས་
en: Once, during the summer, the king went, without great craving, to a cool and peaceful park full of flowering trees, together with eight hundred thousand of the ladies.

source: རྒྱལ་པོ་ཡིད་གཉིས་ལས་ཡང་དག་པར་འདས་པ་དེའི་སྨོན་ལམ་འདི་ལྟ་བུ་དག་བཏབ་བོ། །
en: There King Beyond Doubt made the following prayer:

source: བདག་དང་ཉེ་བའི་སེམས་ཅན་གང་དག་ནོར་མེད་པ་དེ་དག་བདག་གིས་རྒྱལ་པོའི་མཛོད་ནས་ནོར་དང་ལྡན་པར་བྱའོ། །
en: ‘May all beings who are near me and experience poverty avail themselves of my treasury and find wealth.’

source: ཞེས་དེ་ལྟ་བུའི་བསམ་པས་རྒྱལ་སྲིད་བྱེད་དོ། །
en: And with this thought in mind he ruled his kingdom.

source: རྒྱལ་པོ་ཡིད་གཉིས་ལས་ཡང་དག་པར་འདས་པ་དེ་ཚུལ་ཁྲིམས་འཆལ་བའི་འདུ་ཤེས་མི་འཇུག་ཚུལ་ཁྲིམས་དང་ལྡན་པའི་འདུ་ཤེས་ཡང་དག་པར་མི་སྤྱོད།
en: “King Beyond Doubt did not have any notions of flawed discipline, nor did he entertain ideas about the observation of discipline.

source: དྲན་པ་དང་ལྡན་པའི་འདུ་ཤེས་ཡང་དག་པར་མི་སྤྱོད་དེ་འདོད་པའི་འདོད་ཆགས་ཀུན་ནས་དཀྲིས་པའི་སེམས་ལ་ཀུན་ཏུ་མི་གནས། ཞེ་སྡང་ཀུན་ནས་དཀྲིས་པའི་སེམས་དང་། གཏི་མུག་ཀུན་ནས་དཀྲིས་པའི་སེམས་ལ་ཀུན་ཏུ་མི་གནས་ཏེ་
en: He did not have any thoughts about being mindful, and neither did he remain ensnared by the mind of desire, the mind of anger, or the mind of stupidity.

source: ཡོངས་སུ་དག་པའི་ཡིད་ཀྱིས་རྟག་ཏུ་བྱང་ཆུབ་ཀྱི་སེམས་དང་བྲལ་བས་ནམས་ཀྱང་མི་གནས་སོ། །
en: Thus, with a completely pure mind , he never separated from the mind of awakening.

source: འོང་བ་དང་འགྲོ་བ་དང་གནས་པ་དང་འདུག་པ་དང་ཉལ་བ་དང་གཉིད་ལོག་པ་ན་དེ་རྒྱགས་པའང་མེད་ན་བག་མེད་པ་ལྟ་ག་ལ་ཞིག་ཡོད།
en: Whether coming, going, staying, sitting, lying down, or asleep, he was free of any conceit. Needless to mention that he did not become careless either.

source: གཞན་དུ་ན་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་རྒྱུན་རབ་ཏུ་འཇུག་སྟེ།
en: Instead he continuously entered the mind of awakening.

source: སེམས་ཅན་སྡུག་བསྔལ་བ་རྣམས་ལ་བྱམས་པ་དང་ལྡན།
en: He had love for suffering beings,

source: སེམས་ཅན་ཉོན་མོངས་པ་རྣམས་ལ་སྙིང་རྗེ་དང་ལྡན་སེམས་ཅན་བདེ་བ་རྣམས་ལ་དགའ་བ་དང་ལྡན།
en: compassion for afflicted beings, delight at witnessing happy beings,

source: སེམས་ཅན་བྱ་བ་ཡོངས་སུ་རྫོགས་པ་རྣམས་ལ་བཏང་སྙོམས་དང་ལྡན་པར་སེམས་བསྐྱེད་དོ། །
en: and equanimity with respect to those who had completed their tasks.

source: མཚན་མོ་ཉལ་བ་ན་སེམས་སྐྱེད་པར་བྱེད་པ་ནི་འཇིག་རྟེན་ན་བདག་གི་དགེ་བའི་རྩ་བ་བསྐྱེད་པར་བྱ་བའི་ཡོན་གནས་ཡོངས་སུ་འཛིན་པ་སུ་ཡོད་གང་ལ་བདག་ཤེས་པར་བྱ།
en: As he lay down to sleep at night, he gave rise to the mind of awakening, wishing, ‘I must find out where in the world to find a person worthy of offerings who will develop my roots of virtue and be my spiritual teacher.

source: བསམ་གཏན་དང་པོ་ལ་ཇི་ལྟར་སྙོམས་པར་འཇུག་པར་བྱ། བསམ་གཏན་དང་པོ་ལས་ཇི་ལྟར་ལྡང་བར་བྱ།
en: How can I rest in the first concentration, and how can I emerge from it?

source: དེ་བཞིན་དུ་བསམ་གཏན་བཞི་པའི་བར་ལ་ཇི་ལྟར་སྙོམས་པར་འཇུག་པར་བྱ། བསམ་གཏན་བཞི་པ་ལས་ཇི་ལྟར་ལྡང་བར་བྱ།
en: Likewise, how can I enter and emerge from all the concentrations up to and including the fourth?

source: དེ་བཞིན་དུ་བྱམས་པ་དང་། སྙིང་རྗེ་དང་། དགའ་བ་དང་། བཏང་སྙོམས་དག་གི་གནས་ཤེས་པ་ལ་ཇི་ལྟར་སྙོམས་པར་འཇུག་པར་བྱ།
en: Likewise, how can I rest in the knowledge of abiding in the states of love, compassion, joy, and equanimity?

source: གནས་ཤེས་པ་ལ་ཇི་ལྟར་ལྡང་བར་བྱ།
en: How can I emerge within the knowledge of abiding?

source: དེ་བཞིན་དུ་ཇི་ལྟར་གནས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། ཇི་ལྟ་བུར་གནས་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། ཇི་ལྟར་གནས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་སྙོམས་པར་འཇུག་པར་བྱ། ཇི་ལྟར་གནས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལས་ལྡང་བར་བྱ།
en: How can I rest in the knowledge of abiding as related to knowledge of the origin , knowledge of cessation, and knowledge of the path that leads to cessation, and how can I emerge from the knowledge of abiding as related to knowledge of the origin , knowledge of cessation, and knowledge of the path that leads to cessation?

source: དེ་བཞིན་དུ་གནས་ཤེས་པ་དང་། ཀུན་འབྱུང་བ་དང་། འགོག་པ་དང་། ལམ་དང་། དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པའི་ཤེས་པ་ལ་ཇི་ལྟར་སྙོམས་པར་འཇུག་པར་བྱ།
en: How can I rest in the knowledge of abiding, the origin , cessation, and the path, as well as the knowledge of omniscience, and how can I emerge from them?

source: ཇི་ལྟར་ལྡང་བར་བྱ། དེ་བཞིན་དུ་ཀུན་འབྱུང་བ་དང་། འགོག་པ་དང་། ལམ་ཤེས་པ་ལ་ཡང་བྱའོ། །
en: And how can I do so for the knowledge of the origin , cessation, and the path?’

source: དེ་ནས་རྒྱལ་པོ་ཡིད་གཉིས་ལས་ཡང་དག་པར་འདས་པའི་གཉེན་རྙིང་བ་སྣག་གི་གཉེན་མཚམས་སྔོན་གྱི་ལྷ་ཞིག་གིས་རྒྱལ་པོའི་ཕོ་བྲང་དེ་སྣང་བར་བྱས་ནས་
en: “At this point a god who was an old friend of King Beyond Doubt, and who had before been his relative, illumined the royal palace.

source: ལུས་མ་སྦས་པར་རྒྱལ་པོ་ཡིད་གཉིས་ལས་ཡང་དག་པར་འདས་པ་དེ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: Without hiding his physical form, the god then spoke the following verses to the king:

source: རྒྱལ་པོ་ཆེན་པོ་ལེགས་སོ་ལེགས། །
en: “ ‘Excellent, Great King, excellent!

source: མི་ཡི་བདག་པོ་ཁྱོད་ལེགས་སོ། །
en: Lord of humans, bravo to you!

source: འཇིག་རྟེན་ཀུན་ལ་ཕན་འདོད་པ། །ཁྱོད་ཀྱི་སེམས་ཀྱི་བསམ་པ་ལེགས། །
en: Intent on benefiting the entire world, You have excellent thoughts on your mind.

source: དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་བཞུགས། །མཚན་ནི་ནྱ་གྲོ་དྷ་ཞེས་བོད། །
en: “ ‘There is a thus-gone one in this world, And he is known by the name Banyan.

source: སངས་རྒྱས་དེ་དྲུང་དེ་སོང་ལ། །སྐྱེ་བོའི་བདག་པོས་ཡོངས་སུ་ཞུས། །
en: Go before that buddha And there, lord of beings, ask your questions.’

source: ལྷ་དེ་ཡི་ནི་ཚིག་དེ་དག །མི་ཡི་བདག་པོས་ཐོས་ནས་སུ། །སེམས་དགའ་ཡིད་ནི་མགུ་གྱུར་ནས། །ལྷ་ལ་མངོན་པར་སྨྲས་པ་ནི། །
en: “As the lord of beings heard These words of the god They filled him with joyous happiness, And so he said:

source: འཇིག་རྟེན་གསལ་བར་མཛད་པ་ཡི། །རྐང་གཉིས་མཆོག་ནི་ཡུལ་གང་ན། །བཞུགས་པ་དེར་ནི་བདག་མཆི་ཞིང་། །བསྙེན་བཀུར་དག་ནི་རབ་ཏུ་བྱ། །
en: “ ‘Wherever the illuminator of the world, Supreme among men, resides, There I shall go myself To worship and to venerate him.’

source: དེ་ནས་ལྷ་དེས་རྒྱལ་པོ་ཡིད་གཉིས་ལས་ཡང་དག་པར་འདས་པ་དེ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: “Then the god spoke the following verses to King Beyond Doubt:

source: ཤར་ཕྱོགས་འདི་ཡི་ཕྱོགས་ཆ་ན། །གྲོང་ཁྱེར་ལྷུན་པོ་འབྱུང་བ་ཡོད། །
en: “ ‘To the east of here Lies the city of Emerging Mounts.

source: དེ་ན་མགོན་པོ་དེ་བཞུགས་ཏེ། །
en: There resides the protector;

source: སྲོག་ཆགས་རྣམས་ལ་ཆོས་སྟོན་ཏོ། །
en: There he teaches the Dharma to beings.

source: དེ་ནི་འཇིག་རྟེན་ཡོན་གནས་ཏེ། །ཕ་རོལ་དག་གི་ཕུལ་བས་འཚོ། །
en: “ ‘He is the object of the world’s worship, Sustained by the offerings of others.
